Repository: 84000/data-translation-memory
Catalog: toh547-v3.tmx
Source language: bo
Languages: en

source: ན་མོ་མཉྫུ་ཤྲི་ཡེ། ཀུ་མཱ་ར་བྷཱུ་ཏཱ་ཡ། བོ་དྷི་སཏྭཱ་ཡ། མ་ཧ་སཏྭ་ཡ། མ་ཧཱ་ཀ་རུ་ཎི་ཀཱ་ཡ། ཏདྱ་ཐཱ། ཨོཾ་ཨ་ར་ཛེ་བི་ར་ཛེ། ཤུད་དྷེ། བི་ཤུད་དྷེ། ཤོ་དྷ་ནི། བི་ཤོ་དྷ་ནི། ཨ་མ་ལེ། བི་མ་ལེ། ཛ་ཡེ། བ་ཧི་ནི། རུ་རུ་ཙ་ལེ་ཧཱུཾ་ཧཱུཾ་ཧཱུཾ། ཕཊ་ཕཊ་ཕཊ་སྭཱ་ཧཱ། གང་གིས་གཟུངས་འདི་འཆང་བར་བྱེད། ཀློག་པར་བྱེད། སྟོན་པར་བྱེད་པ་དེ་ནི་བློ་རྣོ་བ་དང་ལྡན་པར་འགྱུར་རོ།
en: The Dhāraṇī Mañjuśrī’s Promise namo mañjuśriye kumārabhūtāya bodhisattvāya mahāsattvāya mahākaruṇikāya || tadyathā | oṁ araje viraje | śuddhe viśuddhe | śodhani viśodhani | amale vimale | jaye vahini ru ru cale | hūṁ hūṁ hūṁ | phaṭ phaṭ phaṭ svāhā || Those who uphold, read aloud, or teach this dhāraṇī will obtain a keen intellect.

source: །ལན་ཅིག་བཏོན་ན་གཟུངས་བརྒྱ་འཛིན་པར་འགྱུར་རོ། །བསྐལ་པ་སྟོང་དུ་བསགས་པའི་སྡིག་པ་མ་ལུས་པར་བྱང་བར་འགྱུར་རོ།
en: If they chant it a single time, they will memorize a hundred dhāraṇīs, and every single one of the evil deeds they have accumulated over a thousand eons will be purified.

source: །འབུམ་ཕྲག་གཅིག་བཟླས་ན་རིག་པའི་གནས་ལྔ་ལ་མཁས་པར་འགྱུར་རོ།
en: If they recite it a hundred thousand times, they will become erudite in the five sciences.

source: །འབུམ་ཕྲག་གཉིས་བཟླས་ན་ཐོས་པ་འཛིན་པར་འགྱུར་རོ།
en: If they recite it two hundred thousand times, they will retain in memory all the teachings they have heard.

source: །འབུམ་ཕྲག་གསུམ་བཟླས་ན་འཇམ་དཔལ་གྱི་སྐུ་མཐོང་བར་འགྱུར་རོ།
en: If they recite it three hundred thousand times, they will behold the body of Mañjuśrī.

source: །འཇམ་དཔལ་གྱིས་དམ་བཅས་པའི་གཟུངས་རྫོགས་སོ།། །།
en: This concludes the dhāraṇī “Mañjuśrī’s Promise.”
